IDEA Open Model
IDEAProgressReport.CurrentProgressAmount Property
Compatible with IDEA StatiCa v 10.1
 current progress
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public int CurrentProgressAmount { get; set; }
Public Property CurrentProgressAmount As Integer
	Get
	Set
public:
property int CurrentProgressAmount {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
IDEAProgressReport Class
IdeaRS.OpenModel.Message Namespace